# Importing the Cleaned Data (csv)

## Import Dependencies

In [1]:
# basic stuff
import psycopg2
import pandas as pd
import psycopg2.extras
import os

# Imports the method used to connect to DBs
from sqlalchemy import create_engine

# function to establish a session with a connected database
from sqlalchemy.orm import Session

# database compliant datatypes
from sqlalchemy import Column, Integer, String, Float

## Setup the PostgreSQL engine

In [2]:
# password is hard-coded in the connection string as "postgres"
engine = create_engine('postgresql://postgres:postgres@localhost:5432/energy_db')

## Clear out data first
### Start with the fact (dependent) tables first, then drop foreign keys, truncate rest of tables and then re-add keys

In [3]:
# truncate non-dependent tables first
engine.execute('TRUNCATE TABLE state_greenhouse_emissions;')
engine.execute('TRUNCATE TABLE region_degree_days;')
engine.execute('TRUNCATE TABLE facility_emissions;')
engine.execute('TRUNCATE TABLE air_quality;')
engine.execute('TRUNCATE TABLE state_data;')
engine.execute('TRUNCATE TABLE state_region;')

# list of foreign keys to be dropped so the basic data can be truncated, results of "foreign_key_list.sql"
#   this is entirely due to lazyness, so we can copy/paste

# "air_quality"	"fk_air_quality_state"
# "facility_emissions"	"fk_facility_emissions_facility_id"
# "facility"	"fk_facility_state"
# "region_degree_days"	"fk_region_degree_days_region"
# "state_data"	"fk_state_data_state"
# "state_greenhouse_emissions"	"fk_state_greenhouse_emissions_state"
# "state_region"	"fk_state_region_region"
# "state_region"	"fk_state_region_state"

# drop all the foreign keys
engine.execute('ALTER TABLE facility DROP CONSTRAINT fk_facility_state;')
engine.execute('ALTER TABLE state_region DROP CONSTRAINT fk_state_region_region;')
engine.execute('ALTER TABLE state_region DROP CONSTRAINT fk_state_region_state;')
engine.execute('ALTER TABLE state_greenhouse_emissions DROP CONSTRAINT fk_state_greenhouse_emissions_state;')
engine.execute('ALTER TABLE region_degree_days DROP CONSTRAINT fk_region_degree_days_region;')
engine.execute('ALTER TABLE facility_emissions DROP CONSTRAINT fk_facility_emissions_facility_id;')
engine.execute('ALTER TABLE air_quality DROP CONSTRAINT fk_air_quality_state;')
engine.execute('ALTER TABLE state_data DROP CONSTRAINT fk_state_data_state;')

# truncate the rest of the tables
engine.execute('TRUNCATE TABLE state;')
engine.execute('TRUNCATE TABLE facility;')
engine.execute('TRUNCATE TABLE region;')

# add the keys back (table names and columns are in the index name, so it's not hard to decode)
engine.execute('ALTER TABLE facility ADD CONSTRAINT fk_facility_state FOREIGN KEY (state) REFERENCES state (state);')
engine.execute('ALTER TABLE state_region ADD CONSTRAINT fk_state_region_region FOREIGN KEY (region) REFERENCES region (region);')
engine.execute('ALTER TABLE state_region ADD CONSTRAINT fk_state_region_state FOREIGN KEY (state) REFERENCES state (state);')
engine.execute('ALTER TABLE state_greenhouse_emissions ADD CONSTRAINT fk_state_greenhouse_emissions_state FOREIGN KEY (state) REFERENCES state (state);')
engine.execute('ALTER TABLE region_degree_days ADD CONSTRAINT fk_region_degree_days_region FOREIGN KEY (region) REFERENCES region (region);')
engine.execute('ALTER TABLE facility_emissions ADD CONSTRAINT fk_facility_emissions_facility_id FOREIGN KEY (facility_id) REFERENCES facility (facility_id);')
engine.execute('ALTER TABLE air_quality ADD CONSTRAINT fk_air_quality_state FOREIGN KEY (state) REFERENCES state (state);')
engine.execute('ALTER TABLE state_data ADD CONSTRAINT fk_state_data_state FOREIGN KEY (state) REFERENCES state (state);')

In [4]:
# just making sure tables are empty
engine.execute("SELECT * FROM state;").fetchall()

[]

## Importing the metadata first

### state

#### Import, preview

In [5]:
# states
state_file = os.path.join("..","Clean Data Files","state.csv")
state_df = pd.read_csv(state_file, encoding="ISO-8859-1")

# preview the raw data
state_df.head()

  state  state_name
0    AK      Alaska
1    AL     Alabama
2    AR    Arkansas
3    AZ     Arizona
4    CA  California

#### Write to PostgreSQL, return rows to verify
##### Caution, to re-run, you have to run the truncate table code above first

In [6]:
# write dataframe to table, replace the rows if they exist
state_df.to_sql('state', con=engine, if_exists='append', index=False)

# return the data to make sure it was appended correctly
engine.execute("SELECT * FROM state LIMIT 10").fetchall()

[('AK', 'Alaska'),
 ('AL', 'Alabama'),
 ('AR', 'Arkansas'),
 ('AZ', 'Arizona'),
 ('CA', 'California'),
 ('CO', 'Colorado'),
 ('CT', 'Connecticut'),
 ('DE', 'Delaware'),
 ('FL', 'Florida'),
 ('GA', 'Georgia')]

### region
#### import csv, examine df

In [7]:
# states
region_file = os.path.join("..","Clean Data Files","region.csv")
region_df = pd.read_csv(region_file, encoding="ISO-8859-1")

# preview the raw data
region_df.head()

               region region_group
0             Pacific         West
1            Mountain         West
2  West North Central      Midwest
3  West South Central        South
4  East North Central      Midwest

#### write df to table

In [8]:
# write dataframe to table, replace the rows if they exist
region_df.to_sql('region', con=engine, if_exists='append', index=False)

# return the data to make sure it was appended correctly
engine.execute("SELECT * FROM region LIMIT 10").fetchall()

[('Pacific', 'West'),
 ('Mountain', 'West'),
 ('West North Central', 'Midwest'),
 ('West South Central', 'South'),
 ('East North Central', 'Midwest'),
 ('East South Central', 'South'),
 ('Middle Atlantic', 'Northeast'),
 ('New England', 'Northeast'),
 ('South Atlantic', 'South'),
 ('US', 'US (Total)')]

### state_region
#### import csv, examine df

In [9]:
# states
state_region_file = os.path.join("..","Clean Data Files","state_region.csv")
state_region_df = pd.read_csv(state_region_file, encoding="ISO-8859-1")

# preview the raw data
state_region_df.head()

  state    region
0    WA   Pacific
1    OR   Pacific
2    CA   Pacific
3    MT  Mountain
4    ID  Mountain

#### write to database

In [10]:
# write dataframe to table, replace the rows if they exist
state_region_df.to_sql('state_region', con=engine, if_exists='append', index=False)

# return the data to make sure it was appended correctly
engine.execute("SELECT * FROM state_region LIMIT 10").fetchall()

[('WA', 'Pacific'),
 ('OR', 'Pacific'),
 ('CA', 'Pacific'),
 ('MT', 'Mountain'),
 ('ID', 'Mountain'),
 ('WY', 'Mountain'),
 ('NV', 'Mountain'),
 ('AZ', 'Mountain'),
 ('UT', 'Mountain'),
 ('CO', 'Mountain')]

## importing the fun data
### faccility first
#### import csv, examine df

In [11]:
# facility
facility_file = os.path.join("..","Clean Data Files","facility.csv")
facility_df = pd.read_csv(facility_file, encoding="ISO-8859-1")

# preview the raw data
facility_df.head()

,facility id,frs id,facility name,state,latitude,longitude
0,1000001,1.100005e+11,PSE Ferndale Generating Station,WA,48.828707,-122.685533
1,1000033,1.100280e+11,San Gabriel Cogeneration Facility,CA,34.058450,-117.775114
2,1000049,1.100282e+11,Lange,SD,44.121200,-103.260800
3,1000050,1.100414e+11,Wygen I,WY,44.286200,-105.384300
4,1000051,1.100557e+11,"Mariposa Energy, LLC",CA,37.796500,-121.604900

#### Rename colummns

In [12]:
# rename columns to match database column names
facility_df = facility_df.rename(columns={
    'facility id':'facility_id', 
    'frs id': 'frs_id',
    'facility name': 'facility_name'
})
facility_df.head()

,facility_id,frs_id,facility_name,state,latitude,longitude
0,1000001,1.100005e+11,PSE Ferndale Generating Station,WA,48.828707,-122.685533
1,1000033,1.100280e+11,San Gabriel Cogeneration Facility,CA,34.058450,-117.775114
2,1000049,1.100282e+11,Lange,SD,44.121200,-103.260800
3,1000050,1.100414e+11,Wygen I,WY,44.286200,-105.384300
4,1000051,1.100557e+11,"Mariposa Energy, LLC",CA,37.796500,-121.604900

#### append to facility table

In [13]:
# write dataframe to table, replace the rows if they exist
facility_df.to_sql('facility', con=engine, if_exists='append', index=False)

# return the data to make sure it was appended correctly
engine.execute("SELECT * FROM facility LIMIT 10").fetchall()

[('1000001', '110000490166.0', 'PSE Ferndale Generating Station', 'WA', 48.828707, -122.685533),
 ('1000033', '110028036033.0', 'San Gabriel Cogeneration Facility', 'CA', 34.05845, -117.77511399999999),
 ('1000049', '110028229030.0', 'Lange', 'SD', 44.1212, -103.2608),
 ('1000050', '110041417829.0', 'Wygen I', 'WY', 44.2862, -105.3843),
 ('1000051', '110055697107.0', 'Mariposa Energy, LLC', 'CA', 37.7965, -121.6049),
 ('1000052', '110012547431.0', 'Mesquite Generating Station', 'AZ', 33.3451, -112.8638),
 ('1000057', '110012186240.0', 'Tri-Center Naniwa Energy', 'NV', 39.5617, -119.5175),
 ('1000058', '110012509464.0', 'CalPeak Power - Vaca Dixon LLC', 'CA', 38.3989, -121.9239),
 ('1000059', '110021355816.0', 'Tenaska Kiamichi Generating Station', 'OK', 34.6831, -95.9349),
 ('1000060', '110022515777.0', 'Limon Generating Station', 'CO', 39.2038, -103.7005)]

### facility emissions
#### import csv, examine df

In [14]:
# facility emissions
facility_emissions_file = os.path.join("..","Clean Data Files","facility emissions.csv")
facility_emissions_df = pd.read_csv(facility_emissions_file, encoding="ISO-8859-1")

# preview the raw data
facility_emissions_df.head()

   facility id  year  greenhouse emissions
0      1000001  2018            302529.480
1      1000033  2018                 0.000
2      1000049  2018              5929.228
3      1000050  2018            757846.546
4      1000051  2018             65311.308

#### Rename columns

In [15]:
# rename columns to match database column names
facility_emissions_df = facility_emissions_df.rename(columns={
    'facility id':'facility_id', 
    'greenhouse emissions': 'emissions_mt'
})
facility_emissions_df.head()

   facility_id  year  emissions_mt
0      1000001  2018    302529.480
1      1000033  2018         0.000
2      1000049  2018      5929.228
3      1000050  2018    757846.546
4      1000051  2018     65311.308

#### Append to table, update nulls to zeros

In [16]:
# write dataframe to table, replace the rows if they exist
facility_emissions_df.to_sql('facility_emissions', con=engine, if_exists='append', index=False)

# update the "nones" to zeros so they are all numbers
engine.execute("UPDATE facility_emissions SET emissions_mt = 0 WHERE emissions_mt IS NULL;")

#### Review

In [17]:
# return the data to make sure it was appended correctly
engine.execute("SELECT * FROM facility_emissions LIMIT 10").fetchall()

[('1000001', 2018, 302529),
 ('1000033', 2018, 0),
 ('1000049', 2018, 5929),
 ('1000050', 2018, 757847),
 ('1000051', 2018, 65311),
 ('1000052', 2018, 2281560),
 ('1000059', 2018, 2182583),
 ('1000060', 2018, 26176),
 ('1000061', 2018, 27787),
 ('1000068', 2018, 858789)]

### REgion degree days
#### import csv, examine df

In [18]:
# region degree days
region_degree_days_file = os.path.join("..","Clean Data Files","region degree days.csv")
region_degree_days_df = pd.read_csv(region_degree_days_file, encoding="ISO-8859-1")

# preview the raw data
region_degree_days_df.head()

   year region  heating degree days  cooling degree days
0  2018     US               4277.9               1585.3
1  2017     US               3827.6               1428.5
2  2016     US               3878.3               1558.5
3  2015     US               4086.7               1488.2
4  2014     US               4552.1               1298.9

#### Rename columns

In [19]:
# rename columns to match database column names
region_degree_days_df = region_degree_days_df.rename(columns={
    'heating degree days':'heating_degree_days', 
    'cooling degree days': 'cooling_degree_days'
})
region_degree_days_df.head()

   year region  heating_degree_days  cooling_degree_days
0  2018     US               4277.9               1585.3
1  2017     US               3827.6               1428.5
2  2016     US               3878.3               1558.5
3  2015     US               4086.7               1488.2
4  2014     US               4552.1               1298.9

#### Append to table, review

In [20]:
# write dataframe to table, replace the rows if they exist
region_degree_days_df.to_sql('region_degree_days', con=engine, if_exists='append', index=False)

# return the data to make sure it was appended correctly
engine.execute("SELECT * FROM region_degree_days LIMIT 10").fetchall()

[(2018, 'US', 4278, 1585),
 (2017, 'US', 3828, 1429),
 (2016, 'US', 3878, 1559),
 (2015, 'US', 4087, 1488),
 (2014, 'US', 4552, 1299),
 (2013, 'US', 4466, 1307),
 (2012, 'US', 3770, 1496),
 (2011, 'US', 4312, 1470),
 (2010, 'US', 4463, 1457),
 (2009, 'US', 4481, 1241)]

### state greenhouse emissions
#### import data and examine df

In [21]:
# region degree days
state_greenhouse_emissions_file = os.path.join("..","Clean Data Files","state greenhouse emissions.csv")
state_greenhouse_emissions_df = pd.read_csv(state_greenhouse_emissions_file, encoding="ISO-8859-1")

# preview the raw data
state_greenhouse_emissions_df.head()

  state  year  greenhouse emissions
0    AK  2018           2986767.776
1    AK  2017           3084471.884
2    AK  2016           3028203.670
3    AK  2015           3331015.628
4    AK  2014           3244965.564

#### Rename columns

In [22]:
# rename columns to match database column names
state_greenhouse_emissions_df = state_greenhouse_emissions_df.rename(columns={
    'greenhouse emissions':'greenhouse_emissions'
})
state_greenhouse_emissions_df.head()

  state  year  greenhouse_emissions
0    AK  2018           2986767.776
1    AK  2017           3084471.884
2    AK  2016           3028203.670
3    AK  2015           3331015.628
4    AK  2014           3244965.564

#### Append, review

In [23]:
# write dataframe to table, replace the rows if they exist
state_greenhouse_emissions_df.to_sql('state_greenhouse_emissions', con=engine, if_exists='append', index=False)

# return the data to make sure it was appended correctly
engine.execute("SELECT * FROM state_greenhouse_emissions LIMIT 10").fetchall()

[('AK', 2018, 2986767.776),
 ('AK', 2017, 3084471.8840000005),
 ('AK', 2016, 3028203.67),
 ('AK', 2015, 3331015.628),
 ('AK', 2014, 3244965.5640000007),
 ('AK', 2013, 3411938.3880000003),
 ('AK', 2012, 3818412.5279999985),
 ('AK', 2011, 3815045.0960000004),
 ('AL', 2018, 49769099.969),
 ('AL', 2017, 49170431.85999999)]

### State Data!
#### Import csv, examine df

In [24]:
# region degree days
state_data_file = os.path.join("..","Clean Data Files","state data.csv")
state_data_df = pd.read_csv(state_data_file, encoding="ISO-8859-1")

# preview the raw data
state_data_df.head()

,year,state,producer type,energy source,CO2 (MT),SO2 (MT),NOx (MT),consumption,generation (mwh)
0,1990,AK,Total Electric Power Industry,Total,4208809.0,18741.0,12562.0,NaN,5599506.0
1,1990,AK,Total Electric Power Industry,Coal,1468359.0,14023.0,5890.0,404871,510573.0
2,1990,AK,Total Electric Power Industry,Natural Gas,2402658.0,11.0,5538.0,42764948,3466261.0
3,1990,AK,Total Electric Power Industry,Other,0.0,984.0,229.0,NaN,NaN
4,1990,AK,Total Electric Power Industry,Petroleum,337792.0,3723.0,904.0,961837,497116.0

#### Rename columns

In [25]:
# rename columns to match database column names
state_data_df = state_data_df.rename(columns={
    'producer type':'producer_type',
    'energy source':'energy_source',
    'CO2 (MT)':'co2_mt',
    'SO2 (MT)':'so2_mt',
    'NOx (MT)':'nox_mt',
    'generation (mwh)':'generation_mwh'
})

# display  
state_data_df['state'] = state_data_df['state'].str.upper() 
  
state_data_df.head()

,year,state,producer_type,energy_source,co2_mt,so2_mt,nox_mt,consumption,generation_mwh
0,1990,AK,Total Electric Power Industry,Total,4208809.0,18741.0,12562.0,NaN,5599506.0
1,1990,AK,Total Electric Power Industry,Coal,1468359.0,14023.0,5890.0,404871,510573.0
2,1990,AK,Total Electric Power Industry,Natural Gas,2402658.0,11.0,5538.0,42764948,3466261.0
3,1990,AK,Total Electric Power Industry,Other,0.0,984.0,229.0,NaN,NaN
4,1990,AK,Total Electric Power Industry,Petroleum,337792.0,3723.0,904.0,961837,497116.0

#### replaced a '.' with a zero

In [26]:
# error on row 9874
# replacing a decimal with a zero, it throws a SQL error
state_data_df.loc[(state_data_df.consumption == '.'),'consumption']='0'

len(state_data_df)

14522

#### separating out the three rows with empty state values 
Printing out discarded rows

In [27]:
# had to seperate three rows where
clean_state_df = state_data_df[state_data_df['state'] != '  ']

# what was thrown away...
empty_state_df = state_data_df[state_data_df['state'] == '  ']

empty_state_df

,year,state,producer_type,energy_source,co2_mt,so2_mt,nox_mt,consumption,generation_mwh
11817,2003,,Total Electric Power Industry,Coal,NaN,NaN,NaN,NaN,0.0
11818,2003,,Total Electric Power Industry,Natural Gas,NaN,NaN,NaN,NaN,0.0
11819,2003,,Total Electric Power Industry,Petroleum,NaN,NaN,NaN,NaN,0.0

#### Append and review

In [28]:
# write dataframe to table, replace the rows if they exist
clean_state_df.to_sql('state_data', con=engine, if_exists='append', index=False)

# return the data to make sure it was appended correctly
engine.execute("SELECT * FROM state_data LIMIT 10").fetchall()

[(1990, 'AK', 'Total Electric Power Industry', 'Total', 4208809.0, 18741.0, 12562.0, None, 5599506.0),
 (1990, 'AK', 'Total Electric Power Industry', 'Coal', 1468359.0, 14023.0, 5890.0, 404871.0, 510573.0),
 (1990, 'AK', 'Total Electric Power Industry', 'Natural Gas', 2402658.0, 11.0, 5538.0, 42764948.0, 3466261.0),
 (1990, 'AK', 'Total Electric Power Industry', 'Other', 0.0, 984.0, 229.0, None, None),
 (1990, 'AK', 'Total Electric Power Industry', 'Petroleum', 337792.0, 3723.0, 904.0, 961837.0, 497116.0),
 (1990, 'AL', 'Total Electric Power Industry', 'Total', 52936063.0, 505530.0, 218419.0, None, 79652133.0),
 (1990, 'AL', 'Total Electric Power Industry', 'Coal', 51579474.0, 485229.0, 210395.0, 22242353.0, 53658115.0),
 (1990, 'AL', 'Total Electric Power Industry', 'Natural Gas', 1112523.0, 5.0, 2209.0, 10401790.0, 1020714.0),
 (1990, 'AL', 'Total Electric Power Industry', 'Other', 15962.0, 18828.0, 5555.0, None, None),
 (1990, 'AL', 'Total Electric Power Industry', 'Petroleum', 228104.0, 1469.0, 260.0, 249875.0, 138089.0)]

### Air quality data
#### Import, examine df

In [29]:
# region degree days
air_quality_file = os.path.join("final_aqi_df.csv")
air_quality_df = pd.read_csv(air_quality_file, encoding="ISO-8859-1")

# preview the raw data
air_quality_df.head()

,State,Year,CBSA Code,Days with AQI,Good Days,Moderate Days,Unhealthy Days,Unhealthy for Sensitive Groups Days,Very Unhealthy Days,Hazardous Days,Max AQI,90th Percentile AQI,Median AQI,Days CO,Days NO2,Days Ozone,Days SO2,Days PM2.5,Days PM10
0,WA,1990,10140,365,127,112,9,117,0,0,200,128,77,0,0,0,363,0,2
1,OH,1990,10420,365,108,144,7,105,1,0,207,126,74,2,0,102,260,0,1
2,OR,1990,10540,59,52,7,0,0,0,0,66,51,29,0,0,0,0,0,59
3,NY,1990,10580,364,227,109,3,24,1,0,201,91,44,3,94,147,118,0,2
4,NM,1990,10740,365,155,184,2,24,0,0,169,93,56,71,27,240,0,0,27

#### Rename to match table column names

In [30]:
# rename columns to match database column names
air_quality_df = air_quality_df.rename(columns={
    'State':'state',
    'Year':'year',
    'CBSA Code':'cbsa_code',
    'Days with AQI': 'days_with_aqi',
    'Good Days':'good_days',
    'Moderate Days':'moderate_days',
    'Unhealthy Days': 'unhealthy_days',
    'Unhealthy for Sensitive Groups Days': 'unhealthy_sensitive_days',
    'Very Unhealthy Days': 'very_unhealthy_days',
    'Hazardous Days': 'hazardous_days',
    'Max AQI': 'aqi_max',
    '90th Percentile AQI': 'aqi_90_percentile',
    'Median AQI': 'aqi_median',
    'Days CO': 'days_co',
    'Days NO2': 'days_no2',
    'Days Ozone': 'days_ozone',
    'Days SO2': 'days_so2',
    'Days PM2.5': 'days_pm25',
    'Days PM10': 'days_pm10'
})

air_quality_df.head()

,state,year,cbsa_code,days_with_aqi,good_days,moderate_days,unhealthy_days,unhealthy_sensitive_days,very_unhealthy_days,hazardous_days,aqi_max,aqi_90_percentile,aqi_median,days_co,days_no2,days_ozone,days_so2,days_pm25,days_pm10
0,WA,1990,10140,365,127,112,9,117,0,0,200,128,77,0,0,0,363,0,2
1,OH,1990,10420,365,108,144,7,105,1,0,207,126,74,2,0,102,260,0,1
2,OR,1990,10540,59,52,7,0,0,0,0,66,51,29,0,0,0,0,0,59
3,NY,1990,10580,364,227,109,3,24,1,0,201,91,44,3,94,147,118,0,2
4,NM,1990,10740,365,155,184,2,24,0,0,169,93,56,71,27,240,0,0,27

In [31]:
# write dataframe to table, replace the rows if they exist
air_quality_df.to_sql('air_quality', con=engine, if_exists='append', index=False)

# return the data to make sure it was appended correctly
engine.execute("SELECT * FROM air_quality LIMIT 10").fetchall()

[('WA', 1990, '10140', 365, 127, 112, 9, 117, 0, 0, 200, 128, 77, 0, 0, 0, 363, 0, 2),
 ('OH', 1990, '10420', 365, 108, 144, 7, 105, 1, 0, 207, 126, 74, 2, 0, 102, 260, 0, 1),
 ('OR', 1990, '10540', 59, 52, 7, 0, 0, 0, 0, 66, 51, 29, 0, 0, 0, 0, 0, 59),
 ('NY', 1990, '10580', 364, 227, 109, 3, 24, 1, 0, 201, 91, 44, 3, 94, 147, 118, 0, 2),
 ('NM', 1990, '10740', 365, 155, 184, 2, 24, 0, 0, 169, 93, 56, 71, 27, 240, 0, 0, 27),
 ('LA', 1990, '10780', 333, 260, 57, 0, 16, 0, 0, 143, 84, 38, 0, 0, 325, 0, 0, 8),
 ('PA', 1990, '10900', 365, 222, 109, 9, 25, 0, 0, 197, 97, 46, 15, 66, 162, 120, 0, 2),
 ('NJ', 1990, '10900', 365, 222, 109, 9, 25, 0, 0, 197, 97, 46, 15, 66, 162, 120, 0, 2),
 ('MI', 1990, '10940', 144, 101, 24, 0, 19, 0, 0, 142, 105, 26, 15, 0, 0, 129, 0, 0),
 ('PA', 1990, '11020', 361, 219, 106, 3, 33, 0, 0, 172, 100, 46, 0, 0, 189, 172, 0, 0)]